---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.DemandFlowNotSetInLossFamily
source: html/7e7817ea-20d4-1293-3040-41685341d2c1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.DemandFlowNotSetInLossFamily Property

A calculation did not complete because the Demand Flow for the element is not set.

## Syntax (C#)
```csharp
public static FailureDefinitionId DemandFlowNotSetInLossFamily { get; }
```